blogs/gitlab-install-config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-10-20 四 16:26 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>gitlab 安装配置</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">gitlab 安装配置</h1>
<p>
gitlab 是开源的github，除了是git，还能用作code-review，并作为jenkins集成测试的关键环节。除了配置邮件，其它都挺简单，并且邮件发送错误，没有比较详细的日志，排查起来比较麻烦。
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 安装</h2>
<div class="outline-text-2" id="text-1">
<p>
我用的是linux，直接下载rpm包安装的。 <code>rpm -ivh gitlab-ce-8.9.1-ce.1.el6.x86_64</code> 一句话搞定。
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">2</span> 配置</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> 配置模板</h3>
<div class="outline-text-3" id="text-2-1">
<p>
配置的模板是 <code>/opt/gitlab/etc/gitlab.rb.template</code> ，复制到 <code>/etc/gitlab/gitlab.rb</code> ，配置都在这个文件里面。
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.2</span> 需要关注的配置项</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><code>external_url</code> gitlab的uri前缀，例如 <code>http://git.example.com</code></li>
<li><code>git_data_dir</code> git的数据地址，例如 <code>/path-to-big-disk</code></li>
<li><code>unicorn['port']</code> ruby服务器的端口</li>
<li><code>nginx['listen_port']</code> nginx服务器的端口，nginx服务器是ruby服务器的代理</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.3</span> 应用配置</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<code>gitlab-ctl reconfigure</code> 应用配置，并重新启动。每次配置变更，重新运行这个命令即可，命令输出中包含了和之前配置的diff。
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">3</span> 邮件配置及问题诊断</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">3.1</span> 配置</h3>
<div class="outline-text-3" id="text-3-1">
<pre class="example">
gitlab_rails['gitlab_email_enabled'] = true
gitlab_rails['gitlab_email_from'] = 'admin@mail.example.com'
gitlab_rails['gitlab_email_display_name'] = 'git'

gitlab_rails['smtp_enable'] = true
gitlab_rails['smtp_address'] = "mail.example.com"
gitlab_rails['smtp_port'] = 25
gitlab_rails['smtp_user_name'] = "admin@mail.example.com"
gitlab_rails['smtp_password'] = "password-of-admin"
gitlab_rails['smtp_domain'] = "mail.example.com"
gitlab_rails['smtp_authentication'] = "login"
</pre>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">3.2</span> 问题诊断</h3>
<div class="outline-text-3" id="text-3-2">
<p>
核心是用 <code>tcpdump</code> 抓包， <code>tcpdump -i any -nn -p tcp and port 25 -A -s0</code> 观察输出
</p>
<ul class="org-ul">
<li>没有输出，说明gitlab没发邮件。检查配置对不对，例如 <code>smtp_authentication</code> 的值</li>
<li><code>Authentication unsuccessful</code> ，说明密码没配置对</li>
<li><code>Client does not have permissions to send as this sender</code> ， <code>gitlab_email_from</code> 的配置可能必须和 <code>smtp_user_name</code> 一样</li>
</ul>

<p>
只要有输出就好说，根据输出的内容Google就可以了。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2016-10-20 四 16:26</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
